tot0rokr/MeshSerial-of-nRF5-SDK-for-Mesh/nrf5_SDK_for_Mesh_v5.0.0_src/mesh/bootloader/src/dfu_mesh.c
static void send_bank_notifications(void)
{
    const bl_info_type_t bank_types[] =
    {
        BL_INFO_TYPE_BANK_BL,
        BL_INFO_TYPE_BANK_SD,
        BL_INFO_TYPE_BANK_APP
    };
    const dfu_type_t dfu_types[] = {DFU_TYPE_BOOTLOADER, DFU_TYPE_SD, DFU_TYPE_APP};
    const void* p_curr_fwid[] =
    {
        &m_bl_info_pointers.p_fwid->bootloader,
        (void*) &m_bl_info_pointers.p_fwid->sd,
        &m_bl_info_pointers.p_fwid->app
    };

    /* check for available banks */
    for (uint32_t i = 0; i < 3; ++i)
    {
        bl_info_entry_t* p_bank_entry = bootloader_info_entry_get(bank_types[i]);
        if (p_bank_entry)
        {
            bl_evt_t bank_evt;
            bank_evt.type = BL_EVT_TYPE_BANK_AVAILABLE;
            bank_evt.params.bank_available.bank_dfu_type = dfu_types[i];
            fwid_union_cpy(
                    &bank_evt.params.bank_available.bank_fwid,
                    &p_bank_entry->bank.fwid, dfu_types[i]);
            fwid_union_cpy(
                    &bank_evt.params.bank_available.current_fwid,
                    (fwid_union_t*) p_curr_fwid[i],
                    dfu_types[i]);
            bank_evt.params.bank_available.p_bank_addr = p_bank_entry->bank.p_bank_addr;
            bank_evt.params.bank_available.bank_length = p_bank_entry->bank.length;
            bank_evt.params.bank_available.is_signed = p_bank_entry->bank.has_signature;
            (void) bootloader_evt_send(&bank_evt);
        }
    }
}
/********** STATE MACHINE ENTRY POINTS ***********/
static void start_find_fwid(void)
{
    beacon_set(BEACON_TYPE_FWID);
    SET_STATE(DFU_STATE_FIND_FWID);
    memset(&m_transaction, 0, sizeof(transaction_t));
}

static void start_req(dfu_type_t type, fwid_union_t* p_fwid)
{
    m_transaction.authority = 0;
    m_transaction.length = 0;
    m_transaction.p_start_addr = NULL;
    m_transaction.segments_remaining = 0xFFFF;
    m_transaction.segment_count = 0;
    m_transaction.segment_is_valid_after_transfer = false;
    m_transaction.signature_length = 0;
    m_transaction.transaction_id = 0;
    m_transaction.type = type;
    fwid_union_cpy(&m_transaction.target_fwid_union, p_fwid, type);
    SET_STATE(DFU_STATE_DFU_REQ);

    beacon_set(state_beacon_type(type));
}

static void start_ready(dfu_packet_t* p_ready_packet)
{
    if (p_ready_packet->packet_type != DFU_PACKET_TYPE_STATE ||
        p_ready_packet->payload.state.authority == 0 ||
        p_ready_packet->payload.state.dfu_type != m_transaction.type)
    {
        APP_ERROR_CHECK(NRF_ERROR_INVALID_PARAM);
    }
    m_transaction.transaction_id = p_ready_packet->payload.state.transaction_id;
    m_transaction.authority = p_ready_packet->payload.state.authority;
    m_transaction.flood = p_ready_packet->payload.state.flood;
    SET_STATE(DFU_STATE_READY);

    beacon_set(state_beacon_type(m_transaction.type));
}

static void start_target(void)
{
    SET_STATE(DFU_STATE_TARGET);

    bl_info_entry_t flags_entry;
    memset(&flags_entry, 0xFF, (BL_INFO_LEN_FLAGS + 3) & ~0x03UL);

    switch (m_transaction.type)
    {
        case DFU_TYPE_SD:
            flags_entry.flags.sd_intact = false;
            break;
        case DFU_TYPE_APP:
            flags_entry.flags.app_intact = false;
            break;
        case DFU_TYPE_BOOTLOADER:
            flags_entry.flags.bl_intact = false;
            break;
        default: APP_ERROR_CHECK(NRF_ERROR_INVALID_PARAM);
    }

    if (m_transaction.p_bank_addr != m_transaction.p_start_addr)
    {
        /* check whether we're destroying some bank: */
        bl_info_type_t bl_type[] = {
            BL_INFO_TYPE_BANK_SD,
            BL_INFO_TYPE_BANK_BL,
            BL_INFO_TYPE_BANK_APP,
        };

        uint32_t* p_first_bank = (uint32_t*) 0xFFFFFFFF;
        for (uint32_t i = 0; i < ARRAY_SIZE(bl_type); ++i)
        {
            /* if a bank is overlapping, we should erase info pointing to it. */
            const bl_info_entry_t* p_bank = bootloader_info_entry_get(bl_type[i]);
            if (p_bank)
            {
                if (section_overlap(
                    (uint32_t) p_bank->bank.p_bank_addr,
                    p_bank->bank.length,
                    (uint32_t) m_transaction.p_bank_addr,
                    m_transaction.length))
                {
                    __LOG("Invalidate bank type %s (%d)\n", m_dfu_type_strs[(1 << i)], i);
                    APP_ERROR_CHECK(bootloader_info_entry_invalidate((bl_info_type_t) (BL_INFO_TYPE_BANK_BASE + (1 << i))));
                }
                if (p_bank->bank.p_bank_addr < p_first_bank)
                {
                    p_first_bank = p_bank->bank.p_bank_addr;
                }
            }
        }

        /* Look for any section data inside the new bank-section. If found, we
           are about to invalidate the application, and should mark it. Don't
           look through any known banks. */
        for (uint32_t* p_addr = m_transaction.p_bank_addr;
                p_addr < (uint32_t*) ((uint32_t) m_transaction.p_bank_addr + m_transaction.length) &&
                p_addr < p_first_bank;
                p_addr++)
        {
            if (*p_addr != 0xFFFFFFFF)
            {
                if (m_bl_info_pointers.p_segment_sd->start < (uint32_t) p_addr &&
                        m_bl_info_pointers.p_segment_sd->start +
                        m_bl_info_pointers.p_segment_sd->length > (uint32_t) p_addr)
                {
                    flags_entry.flags.sd_intact = false;
                }
                if (m_bl_info_pointers.p_segment_bl->start < (uint32_t) p_addr &&
                        m_bl_info_pointers.p_segment_bl->start +
                        m_bl_info_pointers.p_segment_bl->length > (uint32_t) p_addr)
                {
                    flags_entry.flags.bl_intact = false;
                }
                if (m_bl_info_pointers.p_segment_app->start < (uint32_t) p_addr &&
                        m_bl_info_pointers.p_segment_app->start +
                        m_bl_info_pointers.p_segment_app->length > (uint32_t) p_addr)
                {
                    flags_entry.flags.app_intact = false;
                }
            }
        }
    }

    /* Tag the transfer as incomplete in device page if we're about to overwrite it. */
    if (m_transaction.p_start_addr == m_transaction.p_bank_addr)
    {
        if (m_bl_info_pointers.p_flags == NULL)
        {
            m_bl_info_pointers.p_flags = &bootloader_info_entry_put(BL_INFO_TYPE_FLAGS, &flags_entry, BL_INFO_LEN_FLAGS)->flags;
        }
        else if (bootloader_info_entry_overwrite(BL_INFO_TYPE_FLAGS, &flags_entry) != NRF_SUCCESS)
        {
            start_req(m_transaction.type, &m_transaction.target_fwid_union);
        }
    }

    __LOG("Transferring...\n");
    if (dfu_transfer_start(
                m_transaction.p_start_addr,
                m_transaction.p_bank_addr,
                m_transaction.length,
                m_transaction.segment_is_valid_after_transfer) == NRF_SUCCESS)
    {
        bl_evt_t abort_evt;
        abort_evt.type = BL_EVT_TYPE_TX_ABORT;
        abort_evt.params.tx.abort.tx_slot = TX_SLOT_BEACON;
        (void) bootloader_evt_send(&abort_evt);

        bl_evt_t target_start_evt;
        target_start_evt.type = BL_EVT_TYPE_DFU_START;
        target_start_evt.params.dfu.start.role = DFU_ROLE_TARGET;
        target_start_evt.params.dfu.start.dfu_type = m_transaction.type;
        target_start_evt.params.dfu.start.fwid = m_transaction.target_fwid_union;
        (void) bootloader_evt_send(&target_start_evt);
    }
    else
    {
        start_req(m_transaction.type, &m_transaction.target_fwid_union);
    }
}

static void start_rampdown(void)
{
    bl_evt_t timer_evt;
    timer_evt.type = BL_EVT_TYPE_TIMER_SET;
    timer_evt.params.timer.set.delay_us = STATE_TIMEOUT_RAMPDOWN;
    timer_evt.params.timer.set.index = 0;
    (void) bootloader_evt_send(&timer_evt);

