tot0rokr/MeshSerial-of-nRF5-SDK-for-Mesh/nrf5_SDK_for_Mesh_v5.0.0_src/mesh/bootloader/src/dfu_mesh.c
    SET_STATE(DFU_STATE_VALIDATE);
}

static uint32_t notify_state_packet(dfu_packet_t* p_packet)
{
    bl_evt_t fw_evt;
    fw_evt.type = BL_EVT_TYPE_DFU_NEW_FW;
    fw_evt.params.dfu.new_fw.fw_type = (dfu_type_t) p_packet->payload.state.dfu_type;
    fw_evt.params.dfu.new_fw.state = m_state;
    fwid_union_cpy(
            &fw_evt.params.dfu.new_fw.fwid,
            &p_packet->payload.state.fwid,
            (dfu_type_t) p_packet->payload.state.dfu_type);
    return bootloader_evt_send(&fw_evt);
}

static uint32_t request_data(uint16_t segment, uint32_t req_slot)
{
    dfu_packet_t req_packet;
    req_packet.packet_type = DFU_PACKET_TYPE_DATA_REQ;
    req_packet.payload.req_data.segment = segment;
    req_packet.payload.req_data.transaction_id = m_transaction.transaction_id;

    /* Use beacon slot */
    bl_evt_t tx_evt;
    tx_evt.type = BL_EVT_TYPE_TX_RADIO;
    tx_evt.params.tx.radio.p_dfu_packet = &req_packet;
    tx_evt.params.tx.radio.length = DFU_PACKET_LEN_DATA_REQ;
    tx_evt.params.tx.radio.interval_type = TX_INTERVAL_TYPE_REQ;
    tx_evt.params.tx.radio.tx_count = TX_REPEATS_REQ;
    tx_evt.params.tx.radio.tx_slot = (uint8_t)req_slot;
    uint32_t status = bootloader_evt_send(&tx_evt);
    if (status == NRF_SUCCESS)
    {
        __LOG("TX REQ FOR %d\n", segment);
    }
    return status;
}

/* check whether we've lost any entries, and request them */
static bool request_missing_data(uint16_t prev_segment, uint32_t req_slot)
{
    uint32_t* p_req_entry = NULL;
    uint32_t req_entry_len = 0;

    if (dfu_transfer_get_oldest_missing_entry(
                m_transaction.p_last_requested_entry,
                &p_req_entry,
                &req_entry_len) &&
            (
             /* don't request the previous packet yet */
             (ADDR_SEGMENT(p_req_entry, m_transaction.p_start_addr) < (uint32_t)(prev_segment - 1)) ||
             (m_transaction.segment_count == prev_segment)
            )
       )
    {
        uint16_t segment = ADDR_SEGMENT(p_req_entry, m_transaction.p_start_addr);
        uint32_t status = request_data(segment, req_slot);
        if (status == NRF_SUCCESS)
        {
            m_transaction.p_last_requested_entry = (uint32_t*) p_req_entry;
            m_data_req_segments[req_slot] = segment;
        }
        return true;
    }
    else
    {
        return false;
    }
}
/*************** Packet handlers ******************/
static uint32_t target_rx_start(dfu_packet_t* p_packet, bool* p_do_relay)
{
    bl_info_segment_t* p_segment = NULL;
    switch (m_transaction.type)
    {
        case DFU_TYPE_APP:
            p_segment = m_bl_info_pointers.p_segment_app;
            break;
        case DFU_TYPE_SD:
            p_segment = m_bl_info_pointers.p_segment_sd;
            break;
        case DFU_TYPE_BOOTLOADER:
            p_segment = m_bl_info_pointers.p_segment_bl;
            break;
        default:
            APP_ERROR_CHECK(NRF_ERROR_NOT_SUPPORTED);
            return NRF_ERROR_NOT_SUPPORTED;
    }

    m_transaction.p_indicated_start_addr = (uint32_t*) p_packet->payload.start.start_address;
    uint32_t start_address = p_packet->payload.start.start_address;
    /* if the host doesn't know the start address, we use start of segment: */
    if (start_address == START_ADDRESS_UNKNOWN)
    {
        start_address = p_segment->start;
    }
    uint32_t segment_count = segment_count_from_start_packet(p_packet);

    m_transaction.segments_remaining                = segment_count;
    m_transaction.segment_count                     = segment_count;
    m_transaction.p_start_addr                      = (uint32_t*) start_address;
    m_transaction.length                            = p_packet->payload.start.length * 4;
    m_transaction.signature_length                  = p_packet->payload.start.signature_length;
    m_transaction.segment_is_valid_after_transfer   = p_packet->payload.start.last;
    m_transaction.p_last_requested_entry            = NULL;
    m_transaction.signature_bitmap                  = 0;

    /* Reset all transfer specific caches. */
    memset(m_req_cache, 0, REQ_CACHE_SIZE * sizeof(m_req_cache[0]));
    packet_cache_flush();

    /* If no bank was specified, we either have to do it single-banked or find a bank */
    if (m_transaction.p_bank_addr == (uint32_t*) 0xFFFFFFFF)
    {
        if (m_transaction.type == DFU_TYPE_BOOTLOADER)
        {
            __LOG("Placing BL bank at end of application segment.\n");
            uint32_t upper_limit =
                (m_bl_info_pointers.p_segment_app->start) +
                (m_bl_info_pointers.p_segment_app->length);
            if (upper_limit > BOOTLOADERADDR())
            {
                upper_limit = BOOTLOADERADDR();
            }
            /* Place bootloader bank at end of app section */
            m_transaction.p_bank_addr = (uint32_t*) (upper_limit -
                    (m_transaction.length & ((uint32_t) ~(PAGE_SIZE - 1))) -
                    (PAGE_SIZE));
        }
        else
        {
            /* others will be inline. */
            __LOG("Bank: 0x%x\n", m_transaction.p_start_addr);
            m_transaction.p_bank_addr = m_transaction.p_start_addr;
        }
    }
    else
    {
        if ((uint32_t) m_transaction.p_bank_addr + m_transaction.length > BOOTLOADERADDR())
        {
            send_end_evt(DFU_END_ERROR_BANK_IN_BOOTLOADER_AREA);
            start_find_fwid();
            /* Return error to not add packet to cache. */
            return NRF_ERROR_INVALID_LENGTH;
        }
    }

    if (m_transaction.p_start_addr != m_transaction.p_bank_addr &&
        section_overlap((uint32_t) m_transaction.p_start_addr, m_transaction.length,
                        (uint32_t) m_transaction.p_bank_addr, m_transaction.length))
    {
        send_end_evt(DFU_END_ERROR_BANK_AND_DESTINATION_OVERLAP);
        start_find_fwid();
        /* Return error to not add packet to cache. */
        return NRF_ERROR_INVALID_LENGTH;
    }

    __LOG("Set transaction parameters:\n");
    __LOG("\ttype:       %s\n", m_dfu_type_strs[(uint32_t) m_transaction.type]);
    __LOG("\tsegments:   %u\n", segment_count);
    __LOG("\tstart addr: 0x%x\n", start_address);
    __LOG("\tbank addr:  0x%x\n", m_transaction.p_bank_addr);
    __LOG("\tlength:     %u\n", m_transaction.length);
    __LOG("\tsigned:     %s\n", m_transaction.signature_length > 0 ? "YES" : "NO");

    if ((uint32_t) m_transaction.p_start_addr >= p_segment->start &&
        (uint32_t) m_transaction.p_start_addr + m_transaction.length <= p_segment->start + p_segment->length)
    {
        start_target();
        *p_do_relay = true;
    }
    else
    {
        __LOG(RTT_CTRL_TEXT_RED "ERROR: Couldn't make transfer fit inside section.\n");
        tid_cache_entry_put(p_packet->payload.start.transaction_id);
        start_req(m_transaction.type, &m_transaction.target_fwid_union);
    }

    return NRF_SUCCESS;
}

