tot0rokr/MeshSerial-of-nRF5-SDK-for-Mesh/nrf5_SDK_for_Mesh_v5.0.0_src/mesh/bootloader/src/dfu_mesh.c
static int32_t match_with_req_segment(uint16_t segment)
{
    for (uint32_t i = 0; i < REQ_SEGMENT_SIZE; i++)
    {
        if (m_data_req_segments[i] == segment)
        {
            return i;
        }
    }
    return -1;
}

static uint32_t target_rx_data(dfu_packet_t* p_packet, uint16_t length, bool* p_do_relay)
{
    uint32_t* p_addr = NULL;
    uint32_t error_code = NRF_ERROR_NULL;
    int32_t req_slot;

    if ((req_slot = match_with_req_segment(p_packet->payload.data.segment)) >= 0)
    {
        if (0 > req_slot || req_slot >= REQ_SEGMENT_SIZE)
        {
            error_code = NRF_ERROR_INTERNAL;
            goto out;
        }
        uint16_t *m_data_req_segment = &m_data_req_segments[req_slot];
        __LOG("Retransmission segment #%d\n", p_packet->payload.data.segment);

        /* Got missing packet, stop requesting. */
        *m_data_req_segment = DATA_REQ_SEGMENT_NONE;
        bl_evt_t tx_abort_evt;
        tx_abort_evt.type = BL_EVT_TYPE_TX_ABORT;
        tx_abort_evt.params.tx.abort.tx_slot = (uint8_t)req_slot;
        (void) bootloader_evt_send(&tx_abort_evt);
    }

    if (p_packet->payload.data.segment <=
        m_transaction.segment_count - m_transaction.signature_length / SEGMENT_LENGTH)
    {
        p_addr = addr_from_seg(p_packet->payload.data.segment, m_transaction.p_start_addr);

        if (length < (DFU_PACKET_LEN_DATA - SEGMENT_LENGTH))
        {
            error_code = NRF_ERROR_INVALID_LENGTH;
        }
        else
        {
            error_code = dfu_transfer_data((uint32_t) p_addr,
                    p_packet->payload.data.data,
                    length - (DFU_PACKET_LEN_DATA - SEGMENT_LENGTH));
        }
    }
    else /* treat signature packets at the end */
    {
        uint32_t index = p_packet->payload.data.segment -
            (m_transaction.segment_count - m_transaction.signature_length / SEGMENT_LENGTH) - 1;
        if (index >= m_transaction.signature_length / SEGMENT_LENGTH ||
                m_transaction.signature_bitmap & (1 << index))
        {
            error_code = NRF_ERROR_INVALID_STATE;
        }
        else
        {
            if (length < (DFU_PACKET_LEN_DATA - SEGMENT_LENGTH) ||
                length > DFU_PACKET_LEN_DATA)
            {
                error_code = NRF_ERROR_INVALID_LENGTH;
            }
            else
            {
                memcpy(&m_transaction.signature[index * SEGMENT_LENGTH],
                        p_packet->payload.data.data,
                        length - (DFU_PACKET_LEN_DATA - SEGMENT_LENGTH));

                __LOG("Signature packet #%u\n", index);
                m_transaction.signature_bitmap |= (1 << index);
                error_code = NRF_SUCCESS;
            }
        }
    }

    if (error_code != NRF_SUCCESS)
    {
        goto out;
    }
    send_progress_event(p_packet->payload.data.segment, m_transaction.segment_count);
    m_transaction.segments_remaining--;
    *p_do_relay = true;
    while ((req_slot = match_with_req_segment(DATA_REQ_SEGMENT_NONE)) >= 0)
    {
        if (!request_missing_data(p_packet->payload.data.segment, req_slot))
        {
            break;
        }
    }
out:
    return error_code;
}

static uint32_t handle_data_packet(dfu_packet_t* p_packet, uint16_t length)
{
    if (p_packet->payload.data.transaction_id != m_transaction.transaction_id)
    {
        return NRF_ERROR_INVALID_DATA;
    }
    if (packet_in_cache(p_packet))
    {
        return NRF_SUCCESS;
    }

    uint32_t status;
    bool do_relay = false;

    switch (m_state)
    {
        case DFU_STATE_READY:
            if (p_packet->payload.start.segment == 0)
            {
                m_lost_start_edge = 0;
                status = target_rx_start(p_packet, &do_relay);
            }
            else
            {
                m_lost_start_edge++;
                if (m_lost_start_edge < LOST_START_EDGE)  // reach some edge to be sure that we really missed start
                {
                    return NRF_SUCCESS;
                }

                __LOG("ERROR: Received non-0 segment.\n");
                m_lost_start_edge = 0;
                tid_cache_entry_put(m_transaction.transaction_id);
                start_req(m_transaction.type, &m_transaction.target_fwid_union); /* go back to req, we've missed packet 0 */
                status = NRF_ERROR_INVALID_STATE;
            }
            break;

        case DFU_STATE_TARGET:
            if (p_packet->payload.data.segment > 0 &&
                p_packet->payload.data.segment <= m_transaction.segment_count)
            {
                (void) target_rx_data(p_packet, length, &do_relay);
                status = NRF_SUCCESS;
            }
            else
            {
                status = NRF_ERROR_INVALID_DATA;
            }

            /* ending the DFU */
            if (m_transaction.segments_remaining == 0)
            {
                start_rampdown();
            }
            break;

        case DFU_STATE_RELAY_CANDIDATE:
        {
            if (p_packet->payload.data.segment == 0)
            {
                m_transaction.segment_count = segment_count_from_start_packet(p_packet);
            }
            SET_STATE(DFU_STATE_RELAY);
            (void) tx_abort(TX_SLOT_BEACON);

            bl_evt_t relay_evt;
            relay_evt.type = BL_EVT_TYPE_DFU_START;
            relay_evt.params.dfu.start.role = DFU_ROLE_RELAY;
            relay_evt.params.dfu.start.fwid = m_transaction.target_fwid_union;
            relay_evt.params.dfu.start.dfu_type = m_transaction.type;
            status = bootloader_evt_send(&relay_evt);

            do_relay = true;
            break;
        }
        case DFU_STATE_RELAY:
            if (p_packet->payload.data.segment == 0)
            {
                m_transaction.segment_count = segment_count_from_start_packet(p_packet);
            }
            send_progress_event(p_packet->payload.data.segment, m_transaction.segment_count);
            do_relay = true;
            status = NRF_SUCCESS;
            break;
        default:
            status = NRF_ERROR_INVALID_STATE;
            break;
    }

    bool is_cached = false;
    if (do_relay)
    {
        is_cached = NRF_SUCCESS == relay_packet(p_packet, length);
    }

    if (status == NRF_SUCCESS && !is_cached)
    {
        packet_cache_put(p_packet);
    }

