tot0rokr/MeshSerial-of-nRF5-SDK-for-Mesh/nrf5_SDK_for_Mesh_v5.0.0_src/mesh/bootloader/src/dfu_mesh.c
            /* log our attempt at responding */
            if ((status == NRF_SUCCESS) && (p_req_entry == NULL))
            {
                p_req_entry = &m_req_cache[(m_req_index++) & (REQ_CACHE_SIZE - 1)];
                p_req_entry->segment = p_packet->payload.req_data.segment;
            }

            /* Check that p_req_enry is not NULL, if status is not NRF_SUCCESS. If status is 
               NRF_SUCCESS, p_req_entry will always be set. */
            if (p_req_entry != NULL)
            {
                p_req_entry->rx_count = 0;
            }
        }
    }
    else
    {
        status = NRF_ERROR_INVALID_DATA;
    }
    return status;
}

static uint32_t handle_data_rsp_packet(dfu_packet_t* p_packet, uint16_t length)
{
    uint32_t status;
    if (m_state == DFU_STATE_RELAY)
    {
        /* only relay new packets, look for it in cache */
        if (packet_in_cache(p_packet))
        {
            status = NRF_SUCCESS;
        }
        else
        {
            send_progress_event(m_transaction.segment_count - m_transaction.segments_remaining + 1,
                    m_transaction.segment_count);
            status = relay_packet(p_packet, length);
        }
    }
    else
    {
        status = handle_data_packet(p_packet, length);
    }
    return status;
}

/*****************************************************************************
* Interface Functions
*****************************************************************************/

void dfu_mesh_init(uint8_t tx_slots)
{
    SET_STATE(DFU_STATE_INITIALIZED);
    memset(&m_transaction, 0, sizeof(transaction_t));
    memset(m_req_cache, 0, REQ_CACHE_SIZE * sizeof(m_req_cache[0]));
    m_req_index = 0;
    m_tx_slots = tx_slots;

    get_info_pointers();
}

void dfu_mesh_start(void)
{
    memset(&m_transaction, 0, sizeof(transaction_t));
    memset(m_req_cache, 0, sizeof(req_cache_entry_t) * REQ_CACHE_SIZE);
    m_req_index = 0;
    memset(m_data_req_segments, 0, sizeof(uint16_t) * REQ_SEGMENT_SIZE);
    get_info_pointers();
    send_bank_notifications();
    packet_cache_flush();

    if (!dfu_bank_transfer_in_progress())
    {
        __LOG("DFU mesh start: \n");
        __LOG("\tAPP: %08x.%04x:%08x\n",
                (uint32_t) m_bl_info_pointers.p_fwid->app.company_id,
                (uint32_t) m_bl_info_pointers.p_fwid->app.app_id,
                (uint32_t) m_bl_info_pointers.p_fwid->app.app_version);
        __LOG("\tSD:  %04x\n",
                (uint32_t) m_bl_info_pointers.p_fwid->sd);
        __LOG("\tBL:  %02x:%02x\n",
                (uint32_t) m_bl_info_pointers.p_fwid->bootloader.id,
                (uint32_t) m_bl_info_pointers.p_fwid->bootloader.ver);

        start_find_fwid();
    }
    else
    {
        __LOG("Bank Transfer in progress!\n");
        SET_STATE(DFU_STATE_INITIALIZED);
    }
}

uint32_t dfu_mesh_req(dfu_type_t type, fwid_union_t* p_fwid, uint32_t* p_bank_addr)
{
    if (m_state != DFU_STATE_FIND_FWID)
    {
        return NRF_ERROR_INVALID_STATE;
    }

    if ((uint32_t) p_bank_addr >= BOOTLOADERADDR() &&
        (uint32_t) p_bank_addr != 0xFFFFFFFF)
    {
        __LOG("Attempting to overwrite bootloader\n");
        return NRF_ERROR_INVALID_ADDR;
    }

    __LOG("REQUESTING TRANSFER OF %s\n", m_dfu_type_strs[(uint32_t) type]);
    m_transaction.p_bank_addr = p_bank_addr;
    start_req(type, p_fwid);

    return NRF_SUCCESS;
}

uint32_t dfu_mesh_relay(dfu_type_t type, fwid_union_t* p_fwid, uint32_t transaction_id)
{
    if (m_state != DFU_STATE_FIND_FWID &&
        m_state != DFU_STATE_DFU_REQ)
    {
        return NRF_ERROR_INVALID_STATE;
    }

    __LOG("Relay transfer of %s (TID=0x%x)\n", m_dfu_type_strs[type], transaction_id);

    SET_STATE(DFU_STATE_RELAY_CANDIDATE);
    m_transaction.type = type;
    m_transaction.transaction_id = transaction_id;
    fwid_union_cpy(
            &m_transaction.target_fwid_union,
            p_fwid,
            type);
    beacon_set(state_beacon_type(m_transaction.type));
    return NRF_SUCCESS;
}

uint32_t dfu_mesh_rx(dfu_packet_t* p_packet, uint16_t length, bool from_serial)
{
#ifdef DEBUG_LEDS
    static bool led = false;
    if (led)
    {
        NRF_GPIO->OUTCLR = LED_2;
    }
    else
    {
        NRF_GPIO->OUTSET = LED_2;
    }
    led = !led;
#endif
    uint32_t status;

    switch (p_packet->packet_type)
    {
        case DFU_PACKET_TYPE_FWID:
            status = handle_fwid_packet(p_packet);
            break;

        case DFU_PACKET_TYPE_STATE:
            status = handle_state_packet(p_packet);
            break;

        case DFU_PACKET_TYPE_DATA:
            status = handle_data_packet(p_packet, length);
            break;

        case DFU_PACKET_TYPE_DATA_REQ:
            status = handle_data_req_packet(p_packet);
            break;

        case DFU_PACKET_TYPE_DATA_RSP:
            status = handle_data_rsp_packet(p_packet, length);
            break;

        default:
            /* don't care */
            status = NRF_ERROR_INVALID_DATA;
            break;
    }
    return status;
}

void dfu_mesh_timeout(void)
{
    __LOG("TIMEOUT\n");
    switch (m_state)
    {
        case DFU_STATE_FIND_FWID:
            send_end_evt(DFU_END_FWID_VALID);
            break;

        case DFU_STATE_DFU_REQ:
        case DFU_STATE_READY:
            send_end_evt(DFU_END_ERROR_NO_START);
            break;

        case DFU_STATE_TARGET:
            start_req(m_transaction.type, &m_transaction.target_fwid_union);
            break;

        case DFU_STATE_VALIDATE:
            if (signature_check())
            {
                (void) dfu_mesh_finalize();
            }
            else
            {
                /* someone gave us unauthorized firmware */
                send_end_evt(DFU_END_ERROR_UNAUTHORIZED);
            }
            break;
        case DFU_STATE_RELAY:
        case DFU_STATE_RELAY_CANDIDATE:
            send_end_evt(DFU_END_SUCCESS);
            break;
        default:
            break;
    }
}

dfu_type_t dfu_mesh_missing_type_get(void)
{
    bl_info_entry_t* p_fwid_entry = bootloader_info_entry_get(BL_INFO_TYPE_VERSION);
    bl_info_entry_t* p_flag_entry = bootloader_info_entry_get(BL_INFO_TYPE_FLAGS);
    bl_info_entry_t* p_sd_seg_entry = bootloader_info_entry_get(BL_INFO_TYPE_SEGMENT_SD);
    bl_info_entry_t* p_app_seg_entry = bootloader_info_entry_get(BL_INFO_TYPE_SEGMENT_APP);
    if ((p_fwid_entry != NULL) && (p_fwid_entry->version.sd != SD_VERSION_INVALID)) /* only check for SD if we need it. */
    {
        if ( ((p_flag_entry != NULL) && (!p_flag_entry->flags.sd_intact)) || 
             ((p_sd_seg_entry != NULL) && (*((uint32_t*) p_sd_seg_entry->segment.start) == 0xFFFFFFFF)) )
        {
            return DFU_TYPE_SD;
        }
    }

